
from datetime import date
from enum import Enum
from typing import Optional

from pydantic import BaseModel, Extra, validator

"""剑网三查询插件配置"""


class JX3PROFESSION(Enum):
    """剑网三心法枚举"""

    无方 = {"无方", "药宗", "药宗输出", "药宗dps"}
    灵素 = {"灵素", "药奶", "奶药", "药宗奶妈"}
    太玄经 = {"太玄经", "衍天宗", "衍天", "太玄"}
    隐龙诀 = {
        "隐龙诀",
        "隐龙",
        "凌雪阁",
        "凌雪",
    }
    凌海诀 = {
        "凌海诀",
        "凌海",
        "蓬莱",
        "伞爹",
    }
    北傲诀 = {"北傲诀", "北傲", "霸刀", "北傲决"}
    莫问 = {"莫问", "长歌输出", "长歌dps", "长歌"}
    相知 = {"相知", "长歌治疗", "长歌奶", "歌奶", "奶歌"}
    分山劲 = {"分山劲", "分山", "苍云输出", "苍云dps", "苍云"}
    铁骨衣 = {"铁骨衣", "铁骨", "苍云T", "苍云t", "铁王八"}
    笑尘诀 = {"笑尘诀", "笑尘", "丐帮", "丐丐", "要饭的", "笑尘诀"}
    焚影圣诀 = {"焚影圣诀", "焚影", "明教dps", "明教输出", "明教", "喵喵", "焚影圣决"}
    明尊琉璃体 = {"明尊琉璃体", "明尊", "明教T", "明教t", "喵T", "喵t"}
    惊羽诀 = {"惊羽诀", "惊羽", "鲸鱼"}
    天罗诡道 = {"天罗诡道", "田螺", "天罗"}
    毒经 = {"毒经", "读经", "五毒dps", "五毒输出", "五毒", "毒King"}
    补天诀 = {"补天诀", "补天", "奶毒", "毒奶", "补天决"}
    山居剑意 = {"山居剑意", "问水诀", "藏剑", "黄鸡", "山居", "问水", "鸡哥", "风车侠"}
    傲血战意 = {"傲血战意", "傲雪", "傲血", "天策dps", "天策输出", "天策", "哈士奇"}
    铁牢律 = {"铁牢律", "铁牢", "策T", "策t", "天策T", "天策t"}
    太虚剑意 = {"太虚剑意", "太虚", "剑纯", "备胎"}
    紫霞功 = {"紫霞功", "紫霞", "气纯", "渣男"}
    易筋经 = {
        "易筋经",
        "易筋",
        "和尚dps",
        "和尚输出",
        "大师dps",
        "大师输出",
        "少林dps",
        "少林输出",
        "和尚",
        "少林",
        "光头",
    }
    洗髓经 = {"洗髓经", "洗髓", "和尚T", "和尚t", "大师t", "大师T", "少林t", "少林T"}
    冰心诀 = {"冰心诀", "冰心", "冰秀", "七秀dps", "七秀输出", "七秀", "秀秀", "冰心决","冰皇"}
    云裳心经 = {"云裳心经", "云裳", "秀奶", "奶秀"}
    花间游 = {"花间游", "花间", "万花dps", "万花输出", "万花", "花花"}
    离经易道 = {
        "离经易道",
        "离经",
        "奶花",
        "花奶",
    }
    孤锋诀 = {"孤锋诀", "刀宗", "刀爹", "鬼子", "孤峰", "孤锋"}
    山海心诀 = {"万灵山庄", "山海心诀", "兽王庄", "万灵"}

    @classmethod
    def get_profession(cls, name: str) -> Optional[str]:
        """通过别名获取职业名称"""
        for profession in cls:
            if name in profession.value:
                return profession.name
        return None
        
        
class JX3QIYU(Enum):
    """剑网三奇遇枚举"""

    白雪忆 = {"白雪忆", "丰丰"}
    白月皎 = {"白月皎", "小小苏"}
    北行镖 = {"北行镖", "小叮当", "白猫"}
    冰蓝花客 = {"冰蓝花客"}
    沧海笛 = {"沧海笛", "嗷呜"}
    尘网中 = {"尘网中", "崽崽"}
    丹青记 = {"丹青记", "彤彤"}
    滴水恩 = {"滴水恩", "愣头青"}
    滇南行 = {"滇南行", "苗疆客"}
    东海客 = {"东海客", "酒海小龟"}
    锻剑女 = {"锻剑女", "运运"}
    儿女事 = {"儿女事", "星辰小龟"}
    风雨意 = {"风雨意", "迟迟"}
    枫林酒 = {"枫林酒", "枫林客"}
    锋芒展 = {"锋芒展", "圆圆"}
    关外商 = {"关外商", "繁花客"}
    归安志·安 = {"归安志·安", "天天", "归安志安", "安"}
    归安志·归 = {"归安志·归", "花月小龟", "归安志归", "归"}
    归安志·志 = {"归安志·志", "吉瑞", "归安志志", "志"}
    归乡路 = {"归乡路", "童心客"}
    果果 = {"果果", "坚果"}
    孩童书 = {"孩童书", "一杠"}
    红衣歌 = {"红衣歌", "红绸"}
    红羽大将军 = {"红羽大将军", "红羽"}
    话玄虚 = {"话玄虚", "土土"}
    江湖录 = {"江湖录", "小羽"}
    金错刀 = {"金错刀", "金刀", "瀛洲梦"}
    荆轲刺 = {"荆轲刺", "黑刺客"}
    客江干 = {"客江干", "沉溪"}
    露园事 = {"露园事", "瓜皮"}
    谜书生 = {"谜书生", "小苗苗"}
    秘宝图 = {"秘宝图", "沅沅"}
    莫贪杯 = {"莫贪杯", "雀斑"}
    念旧林 = {"念旧林", "雀食"}
    烹调法 = {"烹调法", "将军客"}
    破晓鸣 = {"破晓鸣", "黄袍大将军"}
    青草歌 = {"青草歌", "火璃"}
    戎马边 = {"戎马边", "贵贵"}
    沙海谣 = {"沙海谣", "刀豆"}
    商周客 = {"商周客"}
    胜负局 = {"胜负局", "蟹胜", "蟹负"}
    石敢当 = {"石敢当"}
    太行道 = {"太行道", "阳阳"}
    童蒙志 = {"童蒙志", "安安"}
    小果 = {"小果"}
    小花 = {"小花"}
    小诺 = {"小诺"}
    醉烟波 = {"醉烟波", "饿饿"}
    夜哀鸣 = {"夜哀鸣", "洋洋"}
    乱红鸾 = {"乱红鸾", "礼礼"}
    小小苏 = {"小小苏"}
    烟花戏·春 = {'烟花戏·春', "富富", "烟花戏春", "春"}
    烟花戏·风 = {'烟花戏·风', "鸿鸿", "烟花戏风", "风"}
    烟花戏·秋 = {'烟花戏·秋', "瑞瑞", "烟花戏秋", "秋"}
    烟花戏·月 = {"烟花戏·月", "顺顺", "烟花戏月", "月"}
    一念间 = {"一念间", "财财"}
    一枝栖 = {"一枝栖", "夭夭"}
    缘来会·瓜 = {"缘来会·瓜", "瓜瓜", "缘来会瓜", "瓜"}
    缘来会·铃 = {"缘来会·铃", "懵懵", "缘来会铃", "铃"}
    至尊宝 = {"至尊宝", "小落墨", "黑猫"}
    稚子心 = {"稚子心", "甜豆"}
    竹马情 = {"竹马情", "弈棋小龟"}
    捉妖记 = {"捉妖记", "酒客"}
    捉贼记 = {"捉贼记", "吱吱"}
    清茗经 = {"清茗经", "清茗小龟"}
    兽王佩 = {"兽王佩"}
    幽海牧 = {"幽海牧", "宾宾"}
    枉叹恨 = {"枉叹恨", "错错"}
    鸠雀记 = {"鸠雀记", "喳喳"}
    故岁辞 = {"故岁辞", "岁岁"}
    重洋客 = {"重洋客", "索索"}
    子夜歌 = {"子夜歌", "冥冥"}
    白日梦 = {"白日梦"}
    茶馆奇缘 = {"茶馆奇缘"}
    茶馆悬赏 = {"茶馆悬赏"}
    度人心 = {"度人心"}
    扶摇九天 = {"扶摇九天"}
    故园风雨 = {"故园风雨"}
    黑白路 = {"黑白路"}
    虎啸山林 = {"虎啸山林"}
    护佑苍生 = {"护佑苍生"}
    济苍生 = {"济苍生"}
    旧宴承欢 = {"旧宴承欢"}
    炼狱厨神 = {"炼狱厨神"}
    凌云梯 = {"凌云梯"}
    流年如虹 = {"流年如虹"}
    乱世舞姬 = {"乱世舞姬"}
    平生心愿 = {"平生心愿"}
    清风捕王 = {"清风捕王"}
    庆舞良宵 = {"庆舞良宵"}
    劝学记 = {"劝学记"}
    塞外宝驹 = {"塞外宝驹"}
    三尺青锋 = {"三尺青锋"}
    三山四海 = {"三山四海"}
    韶华故 = {"韶华故"}
    少年行 = {"少年行"}
    生死判 = {"生死判"}
    天涯无归 = {"天涯无归"}
    兔江湖 = {"兔江湖"}
    舞众生 = {"舞众生"}
    惜往日 = {"惜往日"}
    侠行囧途 = {"侠行囧途"}
    雪山恩仇 = {"雪山恩仇"}
    阴阳两界 = {"阴阳两界"}
    争铸吴钩 = {"争铸吴钩"}
    万灵当歌 = {"万灵当歌"}
    千秋铸 = {"千秋铸"}
    镜中琴音 = {"镜中琴音"}
    追魂骨 = {"追魂骨"}
    莫负初心 = {"莫负初心"}
    红尘不渡 = {"红尘不渡"}
    入蛟宫 = {"入蛟宫"}

    @classmethod
    def get_qiyu(cls, name: str) -> Optional[str]:
        """通过别名获取奇遇名称"""
        for qiyu in cls:
            if name in qiyu.value:
                return qiyu.name
        return None

class FireWorkRecord(BaseModel, extra=Extra.ignore):
    """烟花记录"""

    server: str
    """服务器名"""
    name: str
    """烟花名"""
    map_name: str
    """地图名"""
    sender: str
    """发送方"""
    recipient: str
    """接收方"""
    time: str
    """时间"""
    times: int = 1
    """计数"""

    @validator("time", pre=True)
    def check_status(cls, v):
        return date.fromtimestamp(v).strftime("%Y-%m-%d")

    def __eq__(self, other: "FireWorkRecord"):
        return (
            self.server == other.server
            and self.map_name == other.map_name
            and self.name == other.name
            and self.sender == other.sender
            and self.recipient == other.recipient
            and self.time == other.time
        )

class FireWorkRecords(BaseModel, extra=Extra.ignore):
    """马场事件"""

    server: str
    """服务器名"""
    name: str
    """马场名"""
    desc: str
    """事件"""
    time: str
    """时间"""
    times: int = 1
    """计数"""
    
    @validator("time", pre=True)
    def check_status(cls, v):
        return date.fromtimestamp(v).strftime("%Y-%m-%d")
        
    def __eq__(self, other: "FireWorkRecords"):
        return (
            self.server == other.server
            and self.name == other.name
            and self.desc == other.desc
            and self.time == other.time
        )